SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/app_thread.c
#include "raw_image.h"
/**
 * @file    app_thread.c
 * @brief   Multi-threaded Camera + Sensor + Storage
 */

#include <stdio.h>
#include <string.h>
#include "app_thread.h"
#include "app_config.h"
#include "app_cam.h"
#include "perf_debug.h"
#include "vl53l5cx_detection.h"
#include "ws2812.h"
#include "stm32n6xx_hal.h"
#include "stm32n6570_discovery.h"
#include "main.h"

extern I2C_HandleTypeDef hi2c1;
extern uint8_t capture_buf[];
#if CAPTURE_MODE == 1
extern uint8_t save_buf[];
#endif
#if CAPTURE_MODE == 2 || CAPTURE_MODE == 4
extern uint8_t batch_buf[];
#endif

QueueHandle_t    camera_cmd_queue   = NULL;
QueueHandle_t    storage_cmd_queue  = NULL;
QueueHandle_t    sensor_event_queue = NULL;
SemaphoreHandle_t camera_ready_sem  = NULL;
SemaphoreHandle_t storage_done_sem  = NULL;
volatile SensorState_t g_sensor_state = SENSOR_STATE_IDLE;

static volatile int g_capture_busy = 0;
static volatile int g_last_storage_rc = 0;
static volatile int g_last_batch_frames = 0;
/* Camera task reserves IDs before dispatch; failed writes leave an ID gap. */
static uint32_t g_next_snap_id = 0;
static uint32_t g_sd_img_base_block;
#define SD_IMG_HEADER_SIZE  64
#define SD_BLOCK_SIZE       512
static uint32_t g_debug_frame_count = 0;

extern SD_HandleTypeDef hsd1;
extern uint8_t sd_batch_buf[];
PerfTimer_t g_perf_timer;

/* Rebase a post-capture RTC sample onto the exact HAL tick at which a frame
   completed. DS3231 resolution is one second, so capture_tick preserves the
   sub-second ordering while unix_seconds remains second-resolution UTC. */
static RTC_Stamp RTC_RebaseStampToFrame(RTC_Stamp anchor, uint32_t frame_tick)
{
    if (frame_tick == 0U) return anchor;

    uint32_t age_ms = anchor.capture_tick - frame_tick;
    anchor.capture_tick = frame_tick;

    /* Normally Mode-4 kept frames are only tens of ms before the RTC read.
       Handle longer/partial batches too without inventing sub-second UTC. */
    if (anchor.valid && age_ms >= 1000U) {
        uint32_t age_s = age_ms / 1000U;
        if (anchor.unix_seconds >= age_s) anchor.unix_seconds -= age_s;
    }
    return anchor;
}

/* ==================== IPC ==================== */
BaseType_t IPC_Init(void)
{
    camera_cmd_queue = xQueueCreate(CAMERA_CMD_QUEUE_LEN, sizeof(CameraCmd_t));
    if (!camera_cmd_queue) return pdFALSE;
    storage_cmd_queue = xQueueCreate(STORAGE_CMD_QUEUE_LEN, sizeof(StorageCmd_t));
    if (!storage_cmd_queue) return pdFALSE;
    sensor_event_queue = xQueueCreate(SENSOR_EVENT_QUEUE_LEN, sizeof(CameraEvent_typed));
    if (!sensor_event_queue) return pdFALSE;
    camera_ready_sem = xSemaphoreCreateBinary();
    if (!camera_ready_sem) return pdFALSE;
    storage_done_sem = xSemaphoreCreateCounting(STORAGE_CMD_QUEUE_LEN, 0);
    if (!storage_done_sem) return pdFALSE;
    xSemaphoreTake(camera_ready_sem, 0);
    xSemaphoreTake(storage_done_sem, 0);
    g_sd_img_base_block = SD_SNAP_BASE_BLOCK;
    printf("[IPC] OK\n");
    return pdTRUE;
}

void IPC_Deinit(void)
{
    if (camera_cmd_queue) vQueueDelete(camera_cmd_queue);
    if (storage_cmd_queue) vQueueDelete(storage_cmd_queue);
    if (sensor_event_queue) vQueueDelete(sensor_event_queue);
    if (camera_ready_sem) vSemaphoreDelete(camera_ready_sem);
    if (storage_done_sem) vSemaphoreDelete(storage_done_sem);
}

int Capture_IsBusy(void) { return g_capture_busy; }

BaseType_t Capture_RequestSnapOnly(void)
{
    CameraCmd_t cmd = {0}; cmd.type = CAM_CMD_SNAP;
    return xQueueSend(camera_cmd_queue, &cmd, pdMS_TO_TICKS(100));
}

/* ==================== SD AUTO-RECOVERY ==================== */
int SD_Reinit(void)
{
#if PERF_DEBUG_LEVEL >= 1
    printf("[SD] === SD RECOVERY STARTED ===\n");
#endif
    uint32_t saved_block = g_sd_img_base_block;
    HAL_SD_Abort(&hsd1);
    HAL_SD_DeInit(&hsd1);
    vTaskDelay(pdMS_TO_TICKS(100));
    __HAL_RCC_SDMMC2_FORCE_RESET();
    vTaskDelay(pdMS_TO_TICKS(10));
    __HAL_RCC_SDMMC2_RELEASE_RESET();
    vTaskDelay(pdMS_TO_TICKS(10));
    RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};
    PeriphClkInit.PeriphClockSelection  = RCC_PERIPHCLK_SDMMC2;
    PeriphClkInit.Sdmmc2ClockSelection  = RCC_SDMMC2CLKSOURCE_HCLK;
    HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit);
    hsd1.Instance             = SDMMC2;
    hsd1.Init.ClockEdge       = SDMMC_CLOCK_EDGE_RISING;
    hsd1.Init.ClockPowerSave  = SDMMC_CLOCK_POWER_SAVE_DISABLE;
    hsd1.Init.BusWide         = SDMMC_BUS_WIDE_4B;
    hsd1.Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;
    hsd1.Init.ClockDiv        = 2;
    hsd1.State                = HAL_SD_STATE_RESET;
    HAL_SD_MspInit(&hsd1);
    HAL_StatusTypeDef status = HAL_SD_Init(&hsd1);
    if (status == HAL_OK) {
        status = HAL_SD_ConfigWideBusOperation(&hsd1, SDMMC_BUS_WIDE_4B);
        if (status == HAL_OK) { hsd1.Init.BusWide = SDMMC_BUS_WIDE_4B; }
    }
    g_sd_img_base_block = saved_block;
    if (status == HAL_OK) {
#if PERF_DEBUG_LEVEL >= 1
        printf("[SD] Recovery OK! Next write from block %lu\n", (unsigned long)g_sd_img_base_block);
#endif
        return 0;
    }
#if PERF_DEBUG_LEVEL >= 1
    printf("[SD] Recovery FAILED (HAL=0x%08lX)\n", (unsigned long)status);
#endif
    return -1;
}

/* ==================== SD STORE ==================== */
static int SD_WaitForReady(void)
{
    uint32_t wait_ms = 0;
    while (HAL_SD_GetCardState(&hsd1) != HAL_SD_CARD_TRANSFER && wait_ms < 5000) {
        vTaskDelay(pdMS_TO_TICKS(1));
        wait_ms++;
    }
    if (wait_ms >= 5000) {
#if PERF_DEBUG_LEVEL >= 1
        printf("[SD] timeout before next batch (card still PROGRAMMING after %lu ms)\n",
               (unsigned long)wait_ms);
#endif
        return -1;
    }
    return 0;
}

static int SD_StoreRawImage(const uint8_t *img_buf, uint32_t img_size, uint32_t w, uint32_t h,
                            uint32_t pixel_format, uint32_t snap_id, RTC_Stamp stamp)
{
    uint32_t base = g_sd_img_base_block;
    uint32_t batch_blocks = SD_BATCH_WRITE_BLOCKS;
    uint32_t batch_size = batch_blocks * SD_BLOCK_SIZE;
    uint32_t local_batch_count = 0;
    uint32_t i, checksum = 0;

    if (hsd1.SdCard.BlockNbr > 0) {
        uint32_t total_blocks = (SD_IMG_HEADER_SIZE + img_size + SD_BLOCK_SIZE - 1) / SD_BLOCK_SIZE;
        if ((base + total_blocks - 1) >= hsd1.SdCard.BlockNbr) {
#if PERF_DEBUG_LEVEL >= 1
            printf("[SD] OVERFLOW\n");
#endif
            return -1;
        }
    }

    uint32_t checksum_start = HAL_GetTick();
    for (i = 0; i < img_size; i++) checksum ^= img_buf[i];
    g_perf_timer.sd_checksum_ms += HAL_GetTick() - checksum_start;

    sd_image_header_t hdr = {0};
    hdr.magic = SD_HEADER_TAG; hdr.width = w; hdr.height = h;
    hdr.pixel_format = pixel_format; hdr.data_size = img_size;
    RawImage_SetStamp(&hdr, stamp); hdr.checksum = checksum;
    hdr.snap_id = snap_id; memset(hdr.reserved, 0, sizeof(hdr.reserved));

#if PERF_DEBUG_LEVEL >= 1
    printf("[SD] #%" PRIu32 " %lux%lu %lu bytes (%.3f MB)\n",
           snap_id, (unsigned long)w, (unsigned long)h, img_size, img_size / 1048576.0f);
#endif

    uint32_t t_wait = HAL_GetTick();
    if (SD_WaitForReady() != 0) {
#if PERF_DEBUG_LEVEL >= 1
        printf("[SD] Not ready for first write\n");
#endif
        return -1;
    }
    uint32_t wait_ms = HAL_GetTick() - t_wait;

    memset(sd_batch_buf, 0, batch_size);
    memcpy(sd_batch_buf, &hdr, SD_IMG_HEADER_SIZE);
    uint32_t first_chunk = SD_BLOCK_SIZE - SD_IMG_HEADER_SIZE;
    if (first_chunk > img_size) first_chunk = img_size;
    memcpy(sd_batch_buf + SD_IMG_HEADER_SIZE, img_buf, first_chunk);

