SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/app_thread.c
#if TEST_TOF_MODE
        static uint8_t btn_refresh_armed = 1;
        if (btn_refresh_armed && HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13) == GPIO_PIN_SET) {
            vTaskDelay(pdMS_TO_TICKS(BTN_DEBOUNCE_MS));
            if (HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13) == GPIO_PIN_SET) {
                btn_refresh_armed = 0;
                printf("[BTN] PC13 pressed — refreshing baseline(s)...\n");
                BSP_LED_Off(LED_GREEN);
                BSP_LED_On(LED_RED);
                VL53L5CX_RefreshBaseline_Manual();
                BSP_LED_Off(LED_RED);
                BSP_LED_On(LED_GREEN);
                while (HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13) == GPIO_PIN_SET)
                    vTaskDelay(pdMS_TO_TICKS(50));
                btn_refresh_armed = 1;
            }
        }
#endif

#if VL53L5CX_DUAL_SENSOR
        if (cooldown > 0) cooldown--;

        if (VL53L5CX_External_GetState() == EXTERNAL_STATE_MONITORING) {
            (void)VL53L5CX_External_Update();
        }
        VL53L5CX_Primary_CheckWakeTimeout();

        if (VL53L5CX_Primary_IsActive()) {
            if (!VL53L5CX_Update()) vTaskDelay(pdMS_TO_TICKS(10));

#if VL53L5CX_DET_ADAPTIVE_REFRESH_ENABLED > 0
            if (consecutive_window_active &&
                (xTaskGetTickCount() - consecutive_window_start) >=
                    pdMS_TO_TICKS(VL53L5CX_DET_REFRESH_WINDOW_SECS * 1000UL)) {
                consecutive_captures = 0;
                consecutive_window_active = 0;
                printf("[ADAPT] Window expired, counter reset\n");
            }
#endif

            if (VL53L5CX_IsInsectDetected() && cooldown == 0) {
                if (g_capture_busy) {
                    vTaskDelay(pdMS_TO_TICKS(5));
                    continue;
                }
                g_capture_busy = 1;
                g_sensor_state = SENSOR_STATE_PAUSED;
                VL53L5CX_DetectionResult_t res = VL53L5CX_GetResult();

#if PERF_DEBUG_LEVEL >= 1
                const char *trig_str;
                if (res.trigger_source == 1) trig_str = "SIGNAL";
                else if (res.trigger_source == 2) trig_str = "MOTION";
                else if (res.trigger_source == 3) trig_str = "SIGNAL+MOTION";
                else trig_str = "UNKNOWN";
                printf(">>> INSECT DETECTED (Primary, woken by external) [%s]!\n", trig_str);
#endif

#if TEST_TOF_MODE
                printf(">>> TEST: %u zone(s) affected, %u valid\r\n",
                       (unsigned)res.affected_count, (unsigned)res.valid_measurements);
                for (int a = 0; a < res.affected_count; a++)
                    printf("    zone %u -> %lu\r\n", (unsigned)res.affected_zones[a],
                           (unsigned long)res.affected_drop[a]);
                BSP_LED_Off(LED_GREEN); BSP_LED_On(LED_RED);
                vTaskDelay(pdMS_TO_TICKS(TEST_TOF_LED_MS));
                BSP_LED_Off(LED_RED); BSP_LED_On(LED_GREEN);
                g_sensor_state = SENSOR_STATE_RUNNING;
                g_capture_busy = 0;
                cooldown = 30;
                continue;
#else
                BSP_LED_Off(LED_GREEN); BSP_LED_On(LED_RED);
#if WS2812_MODE == 1
                WS2812_FlashStart(WS2812_ILLUMINATION_COLOR, WS2812_ILLUMINATION_BRIGHTNESS);
#elif WS2812_MODE == 0
                WS2812_TurnOn();
#else
                WS2812_TurnOn();
                vTaskDelay(pdMS_TO_TICKS(WS2812_INDICATOR_MS));
                WS2812_TurnOff();
#endif

#if VL53L5CX_DET_ADAPTIVE_REFRESH_ENABLED > 0
                consecutive_captures = consecutive_window_active ? consecutive_captures + 1U : 1U;
                consecutive_window_active = 0;
                printf("[ADAPT] Camera activation %u/%u\n",
                       (unsigned)consecutive_captures,
                       (unsigned)VL53L5CX_DET_MAX_DETECTIONS);
#endif

                PerfTimer_t t;
                PERF_START(t);
                int rc = Capture_RequestSnapshot(60000);
                PERF_STOP(t);
                BSP_LED_Off(LED_RED); BSP_LED_On(LED_GREEN);
#if VL53L5CX_DET_ADAPTIVE_REFRESH_ENABLED > 0
                if (consecutive_captures >= VL53L5CX_DET_MAX_DETECTIONS) {
                    printf("[ADAPT] Maximum activations reached, refreshing baseline\n");
                    VL53L5CX_StopRanging();
                    vTaskDelay(pdMS_TO_TICKS(50));
                    VL53L5CX_StartRanging();
                    vTaskDelay(pdMS_TO_TICKS(200));
                    VL53L5CX_LearnBaseline();
                    consecutive_captures = 0;
                    consecutive_window_active = 0;
                    printf("[ADAPT] Baseline refresh complete\n");
                } else {
                    VL53L5CX_StartRanging();
                    consecutive_window_start = xTaskGetTickCount();
                    consecutive_window_active = 1;
                    printf("[ADAPT] Window opened for %lu s\n",
                           (unsigned long)VL53L5CX_DET_REFRESH_WINDOW_SECS);
                }
#else
                VL53L5CX_StartRanging();
#endif
                g_sensor_state = SENSOR_STATE_RUNNING;
                g_capture_busy = 0;
                cooldown = 5;

                if (rc == 0) {
                    capture_count++;
#if PERF_PRINT_SUMMARY
                    Perf_PrintSummary(&g_perf_timer, capture_count);
                    Perf_UpdateStats(&g_perf_timer);
#endif
                } else {
#if PERF_DEBUG_LEVEL >= 1
                    printf("[SENSOR] Capture FAILED rc=%d\n", rc);
#endif
                }
#endif
            }
        }
#else
        if (!VL53L5CX_Update()) {
            vTaskDelay(pdMS_TO_TICKS(10));
            continue;
        }

        g_debug_frame_count++;
        if (g_debug_frame_count >= 1) g_debug_frame_count = 0;
        if (cooldown > 0) cooldown--;

#if VL53L5CX_DET_ADAPTIVE_REFRESH_ENABLED > 0
        if (consecutive_window_active &&
            (xTaskGetTickCount() - consecutive_window_start) >=
                pdMS_TO_TICKS(VL53L5CX_DET_REFRESH_WINDOW_SECS * 1000UL)) {
            consecutive_captures = 0;
            consecutive_window_active = 0;
            printf("[ADAPT] Window expired, counter reset\n");
        }
#endif

        if (VL53L5CX_IsInsectDetected() && cooldown == 0) {
            if (g_capture_busy) continue;
            g_capture_busy = 1;
            g_sensor_state = SENSOR_STATE_PAUSED;
            VL53L5CX_DetectionResult_t res = VL53L5CX_GetResult();

#if PERF_DEBUG_LEVEL >= 1
            const char *trig_str;
            if (res.trigger_source == 1) trig_str = "SIGNAL";
            else if (res.trigger_source == 2) trig_str = "MOTION";
            else if (res.trigger_source == 3) trig_str = "SIGNAL+MOTION";
            else trig_str = "UNKNOWN";
            printf(">>> INSECT DETECTED [%s]!\n", trig_str);
#endif

