SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/app_thread.c
#if TEST_TOF_MODE
            printf(">>> TEST: %u zone(s) affected, %u valid\r\n",
                   (unsigned)res.affected_count, (unsigned)res.valid_measurements);
            for (int a = 0; a < res.affected_count; a++)
                printf("    zone %u -> %lu\r\n", (unsigned)res.affected_zones[a],
                       (unsigned long)res.affected_drop[a]);
            BSP_LED_Off(LED_GREEN); BSP_LED_On(LED_RED);
            vTaskDelay(pdMS_TO_TICKS(TEST_TOF_LED_MS));
            BSP_LED_Off(LED_RED); BSP_LED_On(LED_GREEN);
            g_sensor_state = SENSOR_STATE_RUNNING;
            g_capture_busy = 0;
            cooldown = 30;
            continue;
#else
            BSP_LED_Off(LED_GREEN); BSP_LED_On(LED_RED);
#if WS2812_MODE == 1
            WS2812_FlashStart(WS2812_ILLUMINATION_COLOR, WS2812_ILLUMINATION_BRIGHTNESS);
#elif WS2812_MODE == 0
            WS2812_TurnOn();
#else
            WS2812_TurnOn();
            vTaskDelay(pdMS_TO_TICKS(WS2812_INDICATOR_MS));
            WS2812_TurnOff();
#endif

#if VL53L5CX_DET_ADAPTIVE_REFRESH_ENABLED > 0
            consecutive_captures = consecutive_window_active ? consecutive_captures + 1U : 1U;
            consecutive_window_active = 0;
            printf("[ADAPT] Camera activation %u/%u\n",
                   (unsigned)consecutive_captures,
                   (unsigned)VL53L5CX_DET_MAX_DETECTIONS);
#endif

            PerfTimer_t t;
            PERF_START(t);
            int rc = Capture_RequestSnapshot(60000);
            PERF_STOP(t);
            BSP_LED_Off(LED_RED); BSP_LED_On(LED_GREEN);
#if VL53L5CX_DET_ADAPTIVE_REFRESH_ENABLED > 0
            if (consecutive_captures >= VL53L5CX_DET_MAX_DETECTIONS) {
                printf("[ADAPT] Maximum activations reached, refreshing baseline\n");
                VL53L5CX_StopRanging();
                vTaskDelay(pdMS_TO_TICKS(50));
                VL53L5CX_StartRanging();
                vTaskDelay(pdMS_TO_TICKS(200));
                VL53L5CX_LearnBaseline();
                consecutive_captures = 0;
                consecutive_window_active = 0;
                printf("[ADAPT] Baseline refresh complete\n");
            } else {
                VL53L5CX_StartRanging();
                consecutive_window_start = xTaskGetTickCount();
                consecutive_window_active = 1;
                printf("[ADAPT] Window opened for %lu s\n",
                       (unsigned long)VL53L5CX_DET_REFRESH_WINDOW_SECS);
            }
#else
            VL53L5CX_StartRanging();
#endif
            g_sensor_state = SENSOR_STATE_RUNNING;
            g_capture_busy = 0;
            cooldown = 5;

            if (rc == 0) {
                capture_count++;
#if PERF_PRINT_SUMMARY
                Perf_PrintSummary(&g_perf_timer, capture_count);
                Perf_UpdateStats(&g_perf_timer);
#endif
            } else {
#if PERF_DEBUG_LEVEL >= 1
                printf("[SENSOR] Capture FAILED rc=%d\n", rc);
#endif
            }
#endif
        }
#endif

        vTaskDelay(pdMS_TO_TICKS(5));
    }
}

/* ==================== CAMERA TASK ==================== */
void camera_task(void *arg)
{
    (void)arg;
    extern volatile int system_ready;
    while (!system_ready) vTaskDelay(pdMS_TO_TICKS(500));

#if CAPTURE_MODE == 2
    CAM_ContinuousStart(capture_buf, MAX_SNAP_FRAME_SIZE, SNAP_WIDTH, SNAP_HEIGHT, SNAP_FPS);
#endif

    uint32_t frame_size = (uint32_t)SNAP_WIDTH * SNAP_HEIGHT * 2UL;

    while (1) {
        CameraCmd_t cmd = {0};
#if CAPTURE_MODE == 1 || CAPTURE_MODE == 2
        CAM_IspUpdate();
#endif
        if (xQueueReceive(camera_cmd_queue, &cmd, pdMS_TO_TICKS(20)) != pdTRUE) continue;

        if (cmd.type == CAM_CMD_SNAP) {
            PERF_MARK(g_perf_timer, CAM_INIT);
            int rc = -1;
            g_last_batch_frames = 0;

#if CAPTURE_MODE == 1
            extern uint8_t save_buf[];
            rc = CAM_ContinuousSnap(save_buf, frame_size);
            PERF_MARK(g_perf_timer, CAM_END);
            if (rc == 0) {
#if PERF_DEBUG_LEVEL >= 1
                printf("[CAM] OK %lu ms\n",
                       (unsigned long)Perf_PhaseElapsed(&g_perf_timer, PERF_PHASE_START, PERF_PHASE_CAM_DEINIT));
#endif
                xSemaphoreGive(camera_ready_sem);
                StorageCmd_t sc = {0};
                sc.type = STORAGE_CMD_SAVE; sc.image_buf = save_buf;
                sc.image_size = frame_size; sc.width = SNAP_WIDTH; sc.height = SNAP_HEIGHT;
                sc.pixel_format = 0; sc.snap_id = g_next_snap_id++;
                sc.stamp = RTC_CaptureStamp();
                xQueueSend(storage_cmd_queue, &sc, pdMS_TO_TICKS(1000));
            } else {
#if PERF_DEBUG_LEVEL >= 1
                printf("[CAM] FAIL\n");
#endif
                xSemaphoreGive(camera_ready_sem);
            }
#elif CAPTURE_MODE == 2 || CAPTURE_MODE == 4
            extern uint8_t batch_buf[];
#if CAPTURE_MODE == 2
            rc = CAM_ContinuousBatchSnap(batch_buf, frame_size);
            PERF_MARK(g_perf_timer, CAM_END);
#else
            rc = CAM_CallbackBatchSnap(batch_buf, frame_size);
            PERF_MARK(g_perf_timer, CAM_END);
#endif
            if (rc > 0) {
                g_last_batch_frames = rc;
#if PERF_DEBUG_LEVEL >= 1
#if CAPTURE_MODE == 4
                printf("[CAM] Callback-Batch: %d frames captured (continuous)\n", rc);
#else
                printf("[CAM] Batch: %d frames captured\n", rc);
#endif
#endif
                xSemaphoreGive(camera_ready_sem);

                /* One RTC transaction after the complete batch. In Mode 4 each
                   frame then receives its own exact camera completion tick. */
                RTC_Stamp rtc_anchor = RTC_CaptureStamp();
                uint32_t first_id = g_next_snap_id;
                g_next_snap_id += (uint32_t)rc;

                for (int f = 0; f < rc; f++) {
                    StorageCmd_t sc = {0};
                    sc.type = STORAGE_CMD_SAVE;
                    sc.image_buf = batch_buf + (f * frame_size);
                    sc.image_size = frame_size;
                    sc.width = SNAP_WIDTH; sc.height = SNAP_HEIGHT;
                    sc.pixel_format = 0; sc.snap_id = first_id + (uint32_t)f;
#if CAPTURE_MODE == 4
                    sc.stamp = RTC_RebaseStampToFrame(
                        rtc_anchor, CAM_GetCallbackFrameTick((uint32_t)f));
#else
                    sc.stamp = rtc_anchor;
#endif
                    if (xQueueSend(storage_cmd_queue, &sc, pdMS_TO_TICKS(1000)) != pdTRUE) {
#if PERF_DEBUG_LEVEL >= 1
                        printf("[CAM] Storage queue full, dropping frame %d\n", f);
#endif
                    }
                }
            } else {
#if PERF_DEBUG_LEVEL >= 1
#if CAPTURE_MODE == 4
                printf("[CAM] Callback-Batch FAIL\n");
#else
                printf("[CAM] Batch FAIL\n");
#endif
#endif
                xSemaphoreGive(camera_ready_sem);
            }
#else
            rc = CAM_CaptureSingleFrame(capture_buf, MAX_SNAP_FRAME_SIZE,
                                        SNAP_WIDTH, SNAP_HEIGHT, SNAP_FPS,
                                        SNAP_WARMUP_FRAMES);
            PERF_MARK(g_perf_timer, CAM_END);
            if (rc == 0) {
#if PERF_DEBUG_LEVEL >= 1
                printf("[CAM] OK %lu ms\n",
                       (unsigned long)Perf_PhaseElapsed(&g_perf_timer, PERF_PHASE_START, PERF_PHASE_CAM_DEINIT));
#endif
                xSemaphoreGive(camera_ready_sem);
                StorageCmd_t sc = {0};
                sc.type = STORAGE_CMD_SAVE; sc.image_buf = capture_buf;
                sc.image_size = frame_size; sc.width = SNAP_WIDTH; sc.height = SNAP_HEIGHT;
                sc.pixel_format = 0; sc.snap_id = g_next_snap_id++;
                sc.stamp = RTC_CaptureStamp();
                xQueueSend(storage_cmd_queue, &sc, pdMS_TO_TICKS(1000));
            } else {
#if PERF_DEBUG_LEVEL >= 1
                printf("[CAM] FAIL\n");
#endif
                xSemaphoreGive(camera_ready_sem);
            }
#endif
        }
    }
}

/* ==================== STORAGE TASK ==================== */
void storage_task(void *arg)
{
    (void)arg;
    extern volatile int system_ready;
    while (!system_ready) vTaskDelay(pdMS_TO_TICKS(500));

    while (1) {
        StorageCmd_t cmd = {0};
        if (xQueueReceive(storage_cmd_queue, &cmd, portMAX_DELAY) != pdTRUE) continue;
        if (cmd.type == STORAGE_CMD_SAVE) {
            PERF_MARK(g_perf_timer, STORAGE);
            uint32_t storage_start = HAL_GetTick();
            int rc = SD_StoreRawImage(cmd.image_buf, cmd.image_size, cmd.width, cmd.height,
                                      cmd.pixel_format, cmd.snap_id, cmd.stamp);
            if (rc != 0) {
#if PERF_DEBUG_LEVEL >= 1
                printf("[SD] FAIL — attempting recovery + retry...\n");
#endif
                if (SD_Reinit() == 0) {
                    rc = SD_StoreRawImage(cmd.image_buf, cmd.image_size, cmd.width, cmd.height,
                                          cmd.pixel_format, cmd.snap_id, cmd.stamp);
                }
            }
            if (rc != 0) g_last_storage_rc = rc;
#if PERF_DEBUG_LEVEL >= 1
            uint32_t storage_elapsed = HAL_GetTick() - storage_start;
#endif
            if (rc == 0) {
#if PERF_DEBUG_LEVEL >= 1
                printf("[SD] OK %lu ms\n", (unsigned long)storage_elapsed);
#endif
            } else {
#if PERF_DEBUG_LEVEL >= 1
                printf("[SD] FAIL %lu ms — image LOST after retry\n", (unsigned long)storage_elapsed);
#endif
                SD_Reinit();
            }
            Perf_StorageComplete(&g_perf_timer, HAL_GetTick() - storage_start,
                                 cmd.image_size, rc == 0);
            xSemaphoreGive(storage_done_sem);
        }
    }
}

